In [2]:
import tushare as ts
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
pro=ts.get_gdp_year()
t=pro.head()
t

,year,gdp,pc_gdp,gnp,pi,si,industry,cons_industry,ti,trans_industry,lbdy
0,2018,919281.0,64644.0,NaN,64745.0,364835.0,305160.2,61808.0,489701.0,40550.2,100223.8
1,2017,820754.3,59201.0,NaN,62099.5,332742.7,278328.2,55313.8,425912.1,37172.6,92348.2
2,2016,740060.8,53680.0,NaN,60139.2,296547.7,247877.7,49702.9,383373.9,33058.8,84648.8
3,2015,685992.9,50028.0,NaN,57774.6,282040.3,236506.3,46626.7,346178.0,30487.8,78340.4
4,2014,641280.6,47005.0,NaN,55626.3,277571.8,233856.4,44880.5,308082.5,28500.9,73582.0

In [5]:
type(t)

pandas.core.frame.DataFrame

In [6]:
t[1:3]   #只能通过行索引，获得行，其中1,3为索引

,year,gdp,pc_gdp,gnp,pi,si,industry,cons_industry,ti,trans_industry,lbdy
1,2017,820754.3,59201.0,NaN,62099.5,332742.7,278328.2,55313.8,425912.1,37172.6,92348.2
2,2016,740060.8,53680.0,NaN,60139.2,296547.7,247877.7,49702.9,383373.9,33058.8,84648.8

In [7]:
t.loc[1:3]  #通过标签获得行或者列，其中1,3为行标签

,year,gdp,pc_gdp,gnp,pi,si,industry,cons_industry,ti,trans_industry,lbdy
1,2017,820754.3,59201.0,NaN,62099.5,332742.7,278328.2,55313.8,425912.1,37172.6,92348.2
2,2016,740060.8,53680.0,NaN,60139.2,296547.7,247877.7,49702.9,383373.9,33058.8,84648.8
3,2015,685992.9,50028.0,NaN,57774.6,282040.3,236506.3,46626.7,346178.0,30487.8,78340.4

In [16]:
t.loc[[1,3],['pi','si','ti']]

        pi        si        ti
1  62099.5  332742.7  425912.1
3  57774.6  282040.3  346178.0

In [22]:
t.loc[1:,['pi','si']]

        pi        si
1  62099.5  332742.7
2  60139.2  296547.7
3  57774.6  282040.3
4  55626.3  277571.8

In [26]:
t[1:3][['pi','si']]

        pi        si
1  62099.5  332742.7
2  60139.2  296547.7

### 无论是loc还是iloc均不可以通过  [ [x:y],['a','n'] ]的方式进行连续行、列的切片

In [28]:
t.loc[[1:3]][['pi','si']]

SyntaxError: invalid syntax (<ipython-input-28-72fb1d53bc5d>, line 1)

In [35]:
t.iloc[2:,[1,3]]

        gdp  gnp
2  740060.8  NaN
3  685992.9  NaN
4  641280.6  NaN

In [36]:
t.iloc[2:4]

,year,gdp,pc_gdp,gnp,pi,si,industry,cons_industry,ti,trans_industry,lbdy
2,2016,740060.8,53680.0,NaN,60139.2,296547.7,247877.7,49702.9,383373.9,33058.8,84648.8
3,2015,685992.9,50028.0,NaN,57774.6,282040.3,236506.3,46626.7,346178.0,30487.8,78340.4